{"id":"998658d7-14bc-4b0c-9ddf-a52120120c15","updated_at":"2026-05-12T06:17:21.951Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.951Z","created_by":"elastic","name":"Multiple IPs attacking SAME account","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Attacking One Account with multiple IPs ","risk_score":50,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"88874f59-c7b5-468a-9de1-fb2aeae8d15a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-waf-nginx-access*"],"query":"url.path : \"/mail/\" AND http.request.method : \"POST\"","filters":[],"threshold":{"field":["event.original.keyword"],"value":1,"cardinality":[{"field":"source.ip.keyword","value":5}]},"actions":[]}
{"id":"b43cf30d-308a-4b06-b763-aa23b8b48fc9","updated_at":"2026-05-12T06:17:21.950Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.950Z","created_by":"elastic","name":"high request rate from a single IP.","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Blocking the request with high rate ","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"c3236a10-5fe0-4f6f-80c3-6a6b386dfa21","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-waf-nginx-access*"],"query":"url.path : \"/mail/\" AND http.request.method : \"POST\"","filters":[],"threshold":{"field":["source.ip.keyword"],"value":50,"cardinality":[]},"actions":[]}
{"id":"4f386fe1-b9fd-4523-a6dc-792b5c003d53","updated_at":"2026-05-12T06:17:21.938Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.938Z","created_by":"elastic","name":"Web: Excessive 5xx errors from a single IP","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects potential vulnerability probing or exploitation attempts causing server errors.","risk_score":55,"severity":"medium","output_index":"","author":["TLSOC"],"false_positives":[],"from":"now-5m","rule_id":"tlsoc-web-004","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0043","name":"Reconnaissance","reference":"https://attack.mitre.org/tactics/TA0043/"},"technique":[{"id":"T1595.002","name":"Active Scanning: Vulnerability Scanning","reference":"https://attack.mitre.org/techniques/T1595/002/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and http.response.status_code >= 500","threshold":{"field":["source.ip.keyword"],"value":20},"actions":[]}
{"id":"d3d5f426-dc04-4859-bc40-0ae6225eb7b0","updated_at":"2026-05-12T06:17:21.936Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.936Z","created_by":"elastic","name":"Web: Directory traversal patterns","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects attempts to traverse directories using ../ or encoded variants.","risk_score":75,"severity":"high","output_index":"","author":["TLSOC"],"false_positives":[],"from":"now-1m","rule_id":"tlsoc-web-007","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and (url.path:(*../* or *..%2f* or *%2e%2e%2f* or *%2e%2e%5c*) or url.query:(*../* or *%2e%2e%2f* or *%2e%2e%5c*))","threshold":{"field":["source.ip.keyword","url.path.keyword"],"value":1},"actions":[]}
{"id":"2884f1e1-a453-421d-a757-e14938f10e8b","updated_at":"2026-05-12T06:17:21.946Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.946Z","created_by":"elastic","name":"Web: Excessive 404 responses from a single IP","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects probable wordlist scanning by counting 404 responses from a single source.","risk_score":50,"severity":"medium","output_index":"","author":["TLSOC"],"false_positives":[],"from":"now-5m","rule_id":"tlsoc-web-001","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0043","name":"Reconnaissance","reference":"https://attack.mitre.org/tactics/TA0043/"},"technique":[{"id":"T1595.003","name":"Active Scanning: Wordlist Scanning","reference":"https://attack.mitre.org/techniques/T1595/003/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and http.response.status_code:404","threshold":{"field":["source.ip.keyword"],"value":50},"actions":[]}
{"id":"c2b143e0-7644-4260-a495-3d44e1220ae9","updated_at":"2026-05-12T06:17:21.941Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.941Z","created_by":"elastic","name":"SSH Brute Force Attempt (Multiple Failures)","tags":[],"interval":"1m","enabled":true,"revision":0,"description":"Detects a high volume of failed SSH login attempts from a single source IP within a short time window. This indicates a brute force or dictionary attack.","risk_score":47,"severity":"medium","note":"### Triage Steps\n\n1. **Analyze Source IP:**\n   - Check `{{parsed_data.src_ip}}` on AbuseIPDB or VirusTotal.\n   - If the IP is internal, contact the machine owner (likely a misconfigured script).\n\n2. **Check for Success (Critical):**\n   - **IMMEDIATE ACTION:** Search for \"Accepted password\" logs from this specific IP address (`{{parsed_data.src_ip}}`) occurring *after* these failures.\n   - If you see Failures -> Success, this is a **successful brute force**. Escalation to High/Critical is required.\n\n3. **Targeted Usernames:**\n   - Check which usernames were attempted. Are they generic (`admin`, `root`, `oracle`) or specific employee names?","license":"","output_index":"","meta":{"from":"1s","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"investigation_fields":{"field_names":["user.name","source.ip"]},"author":[],"false_positives":[],"from":"now-61s","rule_id":"11ace6d6-6e07-4c17-998f-824b60989249","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110","subtechnique":[{"id":"T1110.001","name":"Password Guessing","reference":"https://attack.mitre.org/techniques/T1110/001"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","query":"event.original : \"*Failed password*\"","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"index":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","key":"event.action.keyword","field":"event.action.keyword","params":{"query":"login"},"type":"phrase"},"query":{"match_phrase":{"event.action.keyword":"login"}},"$state":{"store":"appState"}}],"threshold":{"field":["source.ip.keyword"],"value":7,"cardinality":[{"field":"user.name.keyword","value":1}]},"actions":[]}
{"id":"43d7e79c-157a-4c86-9579-c41694b89906","updated_at":"2026-05-12T06:17:21.949Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.949Z","created_by":"elastic","name":"Web: Access to sensitive or admin paths","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects access attempts to common sensitive paths and admin endpoints.","risk_score":55,"severity":"medium","output_index":"","author":["TLSOC"],"false_positives":["Legitimate admin access from trusted IPs"],"from":"now-1m","rule_id":"tlsoc-web-006","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0043","name":"Reconnaissance","reference":"https://attack.mitre.org/tactics/TA0043/"},"technique":[{"id":"T1595.002","name":"Active Scanning: Vulnerability Scanning","reference":"https://attack.mitre.org/techniques/T1595/002/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and url.path:(*/.git* or */.env* or */phpmyadmin* or */wp-admin* or */admin* or */login* or */config* or */backup* or */db* or */.svn* or */.hg*)","threshold":{"field":["source.ip.keyword","url.path.keyword"],"value":1},"actions":[]}
{"id":"8fbaffd2-d6f7-49b3-8ce6-43cc7be31730","updated_at":"2026-05-12T06:17:21.934Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.934Z","created_by":"elastic","name":"Web: XSS patterns in query strings","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects common XSS payloads or encoded script tags in URL queries.","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"0s","kibana_siem_app_url":""},"author":["TLSOC"],"false_positives":[],"from":"now-60s","rule_id":"tlsoc-web-009","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"(event.module : \"web_apache_access\" or event.module : \"mail_apache_access\" or event.module : \"waf-nginx-access\")\nand\n(url.query : \"*script*\" or url.query : \"*%3cscript*\" or url.query : \"*onerror=*\" or url.query : \"*onload=*\" or url.query : \"*%3cimg*\" or url.query : \"*javascript:*\")","filters":[],"threshold":{"field":["source.ip.keyword","url.query.keyword"],"value":1,"cardinality":[]},"actions":[]}
{"id":"e6535ea2-b38c-45b9-a300-ca3d564a3396","updated_at":"2026-05-12T06:17:21.953Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.953Z","created_by":"elastic","name":"Web: Scanner user agents detected","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects common scanning tools via user agent strings.","risk_score":60,"severity":"medium","output_index":"","author":["TLSOC"],"false_positives":["Security testing from approved scanners"],"from":"now-1m","rule_id":"tlsoc-web-005","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0043","name":"Reconnaissance","reference":"https://attack.mitre.org/tactics/TA0043/"},"technique":[{"id":"T1595.002","name":"Active Scanning: Vulnerability Scanning","reference":"https://attack.mitre.org/techniques/T1595/002/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and user_agent.original:(*sqlmap* or *nikto* or *nmap* or *masscan* or *gobuster* or *dirbuster* or *wpscan* or *ffuf* or *acunetix* or *zgrab* or *python-requests* or *curl*)","threshold":{"field":["source.ip.keyword","user_agent.original.keyword"],"value":1},"actions":[]}
{"id":"ab847d12-18a5-4fb7-a9ba-7a71796aab63","updated_at":"2026-05-12T06:17:21.948Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.948Z","created_by":"elastic","name":"Web: Command injection or RCE patterns","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects common command injection or RCE indicators in query strings.","risk_score":85,"severity":"high","license":"","output_index":"","meta":{"from":"0s","kibana_siem_app_url":""},"author":["TLSOC"],"false_positives":[],"from":"now-60s","rule_id":"tlsoc-web-011","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and url.query:(*cmd* or *wget* or *;curl* or *|wget* or *|curl* or *%60* or *`* or *;bash* or *;sh* or *%2fbin%2fsh*)","filters":[],"threshold":{"field":["source.ip.keyword","url.query.keyword"],"value":1,"cardinality":[]},"actions":[]}
{"id":"9c5e386a-e02c-4fc9-84fe-bb09eace9362","updated_at":"2026-05-12T06:17:21.955Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.955Z","created_by":"elastic","name":"File Creation in Root Directory","tags":[],"interval":"1s","enabled":true,"revision":0,"description":"Detects the creation of new files in sensitive system directories like /root, /etc, or /bin. This may indicate malware installation, persistence creation, or rootkit activity.","risk_score":99,"severity":"critical","note":"### Critical File Created\n\n**File Path:** `{{file_path}}`\n**Host:** `{{parsed_data.source_host}}`\n\n**Triage:**\n1. **Identify the File:**\n   - Is `mimi_renamed.txt` a known tool (e.g., Mimikatz)?\n   - Is it a script (`.sh`, `.php`, `.py`)?\n2. **Check Hash:** If your FIM provides file hashes, run them against VirusTotal.\n3. **Correlation:** Did an SSH login occur just before this file was created?","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"author":[],"false_positives":[],"from":"now-61s","rule_id":"7e4c19c3-2619-4731-9a8e-8535825f0f2c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003"},"technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","query":"file.path : (\"/root/*\" OR \"/etc/*\" OR \"/bin/*\" OR \"/sbin/*\") AND event.action: \"ADDED\" and file.owner.keyword : \"root\" ","filters":[],"actions":[]}
{"id":"c9f99b0b-9e07-4dd3-be96-f7df4ab960ed","updated_at":"2026-05-12T06:17:21.954Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.954Z","created_by":"elastic","name":"Brute Force Login Attempt in Roundcube","tags":["Email","web"],"interval":"1s","enabled":true,"revision":0,"description":"Rule triggered if 3 login attempts from one particular user fails","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"investigation_fields":{"field_names":["user.name","client_ip"]},"author":[],"false_positives":[],"from":"now-61s","rule_id":"a1854401-eb29-4a84-b28a-82ee834fd694","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110","subtechnique":[{"id":"T1110.003","name":"Password Spraying","reference":"https://attack.mitre.org/techniques/T1110/003"},{"id":"T1110.004","name":"Credential Stuffing","reference":"https://attack.mitre.org/techniques/T1110/004"}]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003"},"technique":[]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"60b3f25a-9745-44fb-95c8-f1b5e8c5b3c8","query":"auth_status.keyword : \"Failed\" and regex_dir.keyword : \"roundcube\" ","filters":[],"threshold":{"field":["auth_status.keyword"],"value":3,"cardinality":[{"field":"client_ip.keyword","value":1}]},"actions":[]}
{"id":"aee64b25-5768-4568-9055-0b156052849c","updated_at":"2026-05-12T06:17:21.957Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.957Z","created_by":"elastic","name":"SSH Successful Brute Force","tags":["ssh","authentication"],"interval":"1s","enabled":true,"revision":0,"description":"Detects an SSH brute force attack that resulted in a successful authentication. This indicates a likely compromise of user credentials.","risk_score":99,"severity":"critical","note":"###  CRITICAL INCIDENT: Successful Brute Force Detected\n\n**Severity:** Critical\n**Analysis:** This rule detected a sequence where a specific IP address failed authentication 5 times and then successfully authenticated within 15 minutes. This is a high-confidence indicator that a password was guessed or brute-forced.\n\n### Immediate Triage Steps\n1. **Isolate the Host:**\n   - If the host is critical, consider isolating it from the network immediately to prevent lateral movement.\n2. **Lock the User Account:**\n   - The user listed in `parsed_data.user` has likely been compromised. Force a password reset and terminate active sessions.\n3. **Identify the Attacker:**\n   - Check the `parsed_data.src_ip`.\n   - If External: Block immediately at the Firewall/WAF.\n   - If Internal: Identify the infected machine and contain it.\n4. **Check for Command Execution:**\n   - Investigate logs immediately following the \"Accepted password\" event to see what commands the attacker ran. Look for `sudo` usage, file downloads (`curl`, `wget`), or persistence mechanisms (`cron`, `.bashrc`).","license":"","output_index":"","meta":{"from":"5m","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"author":[],"false_positives":[],"from":"now-301s","rule_id":"593c6dbb-6d8d-432e-a3ec-a1000219c166","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110","subtechnique":[{"id":"T1110.001","name":"Password Guessing","reference":"https://attack.mitre.org/techniques/T1110/001"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","data_view_id":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","query":"sequence by source.ip with maxspan=15m\n  [ any where\n      event.module == \"mail_auth\" and\n      event.action == \"login\" and\n      event.outcome == \"failure\" and\n      event.original like \"*sshd*\" and\n      event.original like \"*Failed password*\"\n  ] with runs=5\n  [ any where\n      event.module == \"mail_auth\" and\n      event.action == \"login\" and\n      event.outcome == \"success\" and\n      event.original like \"*sshd*\" and\n      event.original like \"*Accepted password*\"\n  ]\n","filters":[],"actions":[]}
{"id":"33d7dc08-fedc-4362-81cc-dd1d2166fd87","updated_at":"2026-05-12T06:17:21.939Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.939Z","created_by":"elastic","name":"XSS Attack Detected at By ModSecurity","tags":["Web","Application","Firewall","im"],"interval":"1s","enabled":true,"revision":0,"description":"waf detected attack","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://10.130.171.15:5601/app/security"},"author":[],"false_positives":[],"from":"now-61s","rule_id":"ea705364-61df-444b-b353-882c3a537653","max_signals":1,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","query":"service_name.keyword : \"modsec_audit_log\" and event.reason :  \"*XSS*\"","filters":[],"actions":[]}
{"id":"3993570a-3330-48df-a210-36c0cfa5dd20","updated_at":"2026-05-12T06:17:21.958Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.958Z","created_by":"elastic","name":"SQL Attack Detected at By ModSecurity","tags":["Web","Application","Firewall","im"],"interval":"1s","enabled":true,"revision":0,"description":"web detected attack","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://10.130.171.15:5601/app/security"},"author":[],"false_positives":[],"from":"now-61s","rule_id":"4f421577-9437-4851-a41c-4c486016555e","max_signals":1,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","query":"service_name.keyword : \"modsec_audit_log\" and event.reason :  \"*SQL*\"","filters":[],"actions":[]}
{"id":"70cde4a3-bc18-4637-ae54-f26f9366aaf7","updated_at":"2026-05-12T06:17:21.959Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.959Z","created_by":"elastic","name":"Sudo Privilege Escalation to Root","tags":["Identity","Host"],"interval":"1s","enabled":true,"revision":0,"description":"Detects a successful privilege escalation where a user executes a command as 'root' using sudo. This indicates high-privileged access","risk_score":73,"severity":"high","note":"### Triage Steps\n\n1. **Verify Authorization:**\n   - Is user `{{parsed_data.sudo_user}}` an administrator authorized to use root?\n   - Check if there is an approved Change Request associated with this time.\n\n2. **Analyze Command Intent:**\n   - The user ran: `{{parsed_data.command}}`.\n   - If the command is `/usr/bin/su` or `/bin/bash`, the user triggered an interactive root shell. All subsequent logs from this user will show as `root`, making attribution harder.\n   - **Immediate Action:** Filter logs for `user: root` immediately following this timestamp to see what they did *after* escalating.\n\n3. **Check for \"sudo\" Brute Force:**\n   - Search for `pam_message: \"authentication failure\"` involving this user just prior to this event.","license":"","output_index":"","meta":{"from":"5m","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"investigation_fields":{"field_names":["user.name","user.target.name.keyword","source.ip"]},"author":[],"false_positives":[],"from":"now-301s","rule_id":"87b81494-6b56-45fc-bf51-a943f35c528c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004"},"technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548","subtechnique":[{"id":"T1548.003","name":"Sudo and Sudo Caching","reference":"https://attack.mitre.org/techniques/T1548/003"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","query":"user.target.name.keyword : \"root\" ","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"index":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","key":"event.action.keyword","field":"event.action.keyword","params":{"query":"elevation"},"type":"phrase"},"query":{"match_phrase":{"event.action.keyword":"elevation"}},"$state":{"store":"appState"}}],"actions":[]}
{"id":"2c9f39b7-861f-4a46-9780-e61143bc3c63","updated_at":"2026-05-12T06:17:21.945Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.945Z","created_by":"elastic","name":"Web: High request rate from a single IP","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects possible DoS or aggressive scanning by a single source IP.","risk_score":80,"severity":"high","output_index":"","author":["TLSOC"],"false_positives":["Load tests or known monitoring"],"from":"now-5m","rule_id":"tlsoc-web-003","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0040","name":"Impact","reference":"https://attack.mitre.org/tactics/TA0040/"},"technique":[{"id":"T1499","name":"Endpoint Denial of Service","reference":"https://attack.mitre.org/techniques/T1499/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\")","threshold":{"field":["source.ip.keyword"],"value":500},"actions":[]}
{"id":"914edd8f-af93-4be2-8302-659db68b1af9","updated_at":"2026-05-12T06:17:21.942Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.942Z","created_by":"elastic","name":"Web: SQL injection patterns in query strings","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects common SQL injection strings in URL query parameters.","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"0s","kibana_siem_app_url":""},"author":["TLSOC"],"false_positives":[],"from":"now-60s","rule_id":"tlsoc-web-008","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and ((url.query:*union* and url.query:*select*) or url.query:*%27%20or%201%3D1* or url.query:*or%201=1* or url.query:*%27or%271%27=%271* or url.query:*%22%20or%20%221%22=%221*)","filters":[],"threshold":{"field":["source.ip.keyword","url.query.keyword"],"value":1,"cardinality":[]},"actions":[]}
{"id":"8d5d7c45-fc64-4592-beea-50292549e345","updated_at":"2026-05-12T06:17:21.944Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.944Z","created_by":"elastic","name":"Web: Suspicious HTTP methods used","tags":["tlsoc","tlsoc-pack:web","web","mitre"],"interval":"1m","enabled":true,"revision":0,"description":"Detects uncommon or risky HTTP methods in access logs.","risk_score":55,"severity":"medium","output_index":"","author":["TLSOC"],"false_positives":["Legitimate API calls or maintenance operations"],"from":"now-1m","rule_id":"tlsoc-web-010","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["fosstlsoc-logs-*"],"query":"event.module:(\"web_apache_access\" or \"mail_apache_access\" or \"waf-nginx-access\") and http.request.method:(PUT or DELETE or TRACE or CONNECT or PROPFIND)","threshold":{"field":["source.ip.keyword","http.request.method.keyword"],"value":1},"actions":[]}
{"id":"02c535a8-665a-4b14-8ac4-1f47935af004","updated_at":"2026-05-12T06:17:21.961Z","updated_by":"elastic","created_at":"2026-05-12T06:17:21.961Z","created_by":"elastic","name":"SSH Successful Login","tags":["Identity","Host"],"interval":"1s","enabled":true,"revision":0,"description":"Detects a successful SSH authentication event processed by the service. This indicates a user has successfully gained shell access to a host","risk_score":21,"severity":"low","note":"### Triage Steps\n\n1. **Verify User Identity:**\n   - Confirm if user `{{parsed_data.user}}` is authorized to access host `{{service}}`.\n   - If the user is `root`, treat with higher priority.\n\n2. **Analyze Source IP:**\n   - Check `{{parsed_data.src_ip}}` against internal asset lists.\n   - If the IP is external (public), check Geo-location and reputation (VirusTotal/AbuseIPDB).\n\n3. **Contextual Analysis:**\n   - Is this login occurring during standard business hours?\n   - Check for multiple failed login attempts immediately preceding this success (Brute Force followed by Success).","license":"","output_index":"","meta":{"from":"5m","kibana_siem_app_url":"https://10.130.171.246:5601/s/tlsoc/app/security"},"investigation_fields":{"field_names":["source.ip","user.name"]},"author":[],"false_positives":["Scheduled administrative logins ","Automated configuration management tools (e.g., Ansible) connecting via SSH"],"from":"now-301s","rule_id":"a075b408-c826-401f-99d7-64c2e6f5f1bb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078","subtechnique":[{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","query":"event.original : \"*Accepted password*\"","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"index":"4ea16e42-92a0-4495-a6c1-a1848eb235f6","key":"event.action.keyword","field":"event.action.keyword","params":{"query":"login"},"type":"phrase"},"query":{"match_phrase":{"event.action.keyword":"login"}},"$state":{"store":"appState"}}],"actions":[]}
{"exported_count":20,"exported_rules_count":20,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
